In [21]:
import pandas as pd

A Series is a one-dimensional array-like object containing a sequence of values (of
similar types to NumPy types) and an associated array of data labels, called its index

In [22]:
# one dimensional array like object
series_obj = pd.Series([4, 7, -5, 3], index= ["a", "b", "c", "d"])
series_obj

a    4
b    7
c   -5
d    3
dtype: int64

In [23]:
series_obj[series_obj>2]

a    4
b    7
d    3
dtype: int64

Dataframes

In [24]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [25]:
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Transposing the datarame

In [26]:
df_transposed = df.T
df_transposed

          0     1     2       3       4       5
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
year   2000  2001  2002    2001    2002    2003
pop     1.5   1.7   3.6     2.4     2.9     3.2

In [29]:
df.sort_values(by=["pop"]) 
# a list can be passed in this case to group by the column names

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2
2    Ohio  2002  3.6

In [38]:
print(f"Using descriptive statistics feature of pandas dataframes, we can get things like the colum-wise sum :")
print(df.sum())
print("Similarly the average of the values can be obtained by using the average method:")
print(df.mean(axis='columns', skipna=False))

Using descriptive statistics feature of pandas dataframes, we can get things like the colum-wise sum :
state    OhioOhioOhioNevadaNevadaNevada
year                              12009
pop                                15.3
dtype: object
Similarly the average of the values can be obtained by using the average method:
0    1000.75
1    1001.35
2    1002.80
3    1001.70
4    1002.45
5    1003.10
dtype: float64

C:\Users\kshit\AppData\Local\Temp/ipykernel_12052/4259939454.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.mean(axis='columns', skipna=False))

Other methods are accumulations:

In [40]:
df.cumsum()

                            state   year   pop
0                            Ohio   2000   1.5
1                        OhioOhio   4001   3.2
2                    OhioOhioOhio   6003   6.8
3              OhioOhioOhioNevada   8004   9.2
4        OhioOhioOhioNevadaNevada  10006  12.1
5  OhioOhioOhioNevadaNevadaNevada  12009  15.3

In [41]:
df.describe()

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [45]:
import json

obj = """{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38,
 "pets": ["Sixes", "Stache", "Cisco"]}]
}"""
json_df = json.loads(obj)
json_df

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}